Project/Toir/src/Documents/Увольнение/Увольнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Увольнение</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ГрафикРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/КадроваяИсторияСотрудников/КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПоОкончании</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПоОкончании</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписаниюПоОкончании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоОкончании</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавокПоОкончании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидСобытияПоОкончании</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятостиПоОкончании</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.ПриемНаРаботу</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/Увольнение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ФО_УправлениеПерсоналом = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУправлениеПерсоналом");
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты,ЧтениеДанныхДляНачисленияЗарплаты,ДобавлениеИзменениеКадровогоСостоянияРасширенная,ЧтениеКадровогоСостоянияРасширенная") 
		И ФО_УправлениеПерсоналом Тогда
		// Приказ об увольнении
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.торо_ПечатьКадровыхПриказов";
		КомандаПечати.Идентификатор = "ПФ_MXL_Т8";
		КомандаПечати.Представление = НСтр("es='La orden del despido';ru='Приказ об увольнении';en='Dismissal order'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ПечатьДокументовБезПредварительногоПросмотра",
		Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ПечатьРасчетаСреднегоЗаработка

// Заполняет структуру - описание документа для формирования печатной формы расчета среднего заработка.
//
// Параметры:
//   ОписаниеДокумента - структура, определяется в 
//		Обработки.ПечатьРасчетаСреднегоЗаработка.ОписаниеДокументаРасчитывающегоСреднийЗаработок.
//
Процедура ЗаполнитьОписаниеДокументаРасчитывающегоСреднийЗаработок(ОписаниеДокумента) Экспорт
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	ОписаниеДокумента.Вставить("ИмяДокумента", МетаданныеДокумента.Имя);
	ОписаниеДокумента.Вставить("СинонимДокумента", МетаданныеДокумента.Синоним);
КонецПроцедуры 

// Заполняет структуру - параметры формирования печатной формы расчета среднего заработка.
//
// Параметры:
//   ПараметрыФормирования 	- структура, определяется в Обработки.
//							ПечатьРасчетаСреднегоЗаработка.
//							ПараметрыФормированияПечатнойФормыРасчетаСреднегоЗаработка.
//	 Ссылка 				- печатаемый документ.
//
Процедура ЗаполнитьДанныеДокументаДляПечатиРасчетаСреднегоЗаработка(Ссылка, ДанныеДокумента) Экспорт
	
	РеквизитыДокумента = "Организация,Сотрудник,ПериодРасчетаСреднегоЗаработкаНачало,ПериодРасчетаСреднегоЗаработкаОкончание,Дата,Номер,ВидРасчетаКомпенсацииУдержанияОтпуска";
	
	ДанныеРеквизитовДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыДокумента);
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ДанныеРеквизитовДокумента);
	
	ДанныеДокумента.Вставить("НачалоРасчетногоПериода", 	ДанныеРеквизитовДокумента.ПериодРасчетаСреднегоЗаработкаНачало);
	ДанныеДокумента.Вставить("ОкончаниеРасчетногоПериода", 	ДанныеРеквизитовДокумента.ПериодРасчетаСреднегоЗаработкаОкончание);
	ДанныеДокумента.Вставить("НомерДокумента", 				ДанныеРеквизитовДокумента.Номер);
	ДанныеДокумента.Вставить("ДатаДокумента", 				ДанныеРеквизитовДокумента.Дата);
	ДанныеДокумента.Вставить("Начисление", 					ДанныеРеквизитовДокумента.ВидРасчетаКомпенсацииУдержанияОтпуска);
	ДанныеДокумента.Вставить("МассивСотрудников",  			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеРеквизитовДокумента.Сотрудник));
	ДанныеДокумента.Вставить("ИспользоватьСреднеЧасовойЗаработок",	ИспользоватьСреднечасовойЗаработок(Ссылка));
	
КонецПроцедуры

Функция ИспользоватьСреднечасовойЗаработок(Ссылка)
	Возврат Ложь
КонецФункции 

#КонецОбласти

Функция КадровыеСобытияУвольнение(Сотрудник, ДатаУвольнения, ФизическоеЛицо = Неопределено, Позиция = Неопределено, КоличествоСтавок = Неопределено, Организация = Неопределено) Экспорт
	
	// Создаем таблицу событий
	КадровыеСобытия = Новый ТаблицаЗначений;
	КадровыеСобытия.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	КадровыеСобытия.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	КадровыеСобытия.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	КадровыеСобытия.Колонки.Добавить("ВидСобытия", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКадровыхСобытий"));
	
	КадровыеСобытия.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		
	// Заполняем таблицу
	НовоеСобытие = КадровыеСобытия.Добавить();
	НовоеСобытие.Сотрудник = Сотрудник;
	НовоеСобытие.ДатаСобытия = КонецДня(ДатаУвольнения) + 1;
	НовоеСобытие.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	КонецЕсли;
	НовоеСобытие.ФизическоеЛицо = ФизическоеЛицо;
	
	НовоеСобытие.Организация = Организация;
	
	Возврат КадровыеСобытия;
	
КонецФункции

Функция СписокПодходящихСорудников(ДатаНачала, ДатаОкончания, Организация, Текст) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Сотрудники
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Наименование ПОДОБНО &Текст + ""%""
	               |	И Сотрудники.ГоловнаяОрганизация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_ПринятыеСотрудники
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК КадроваяИсторияСотрудниковСрезПоследних
	               |ГДЕ
	               |	(КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = &Прием
	               |			ИЛИ КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = &Перемещение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_УволенныеСотрудники
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	               |ГДЕ
	               |	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = &Увольнение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВТ_Сотрудники КАК ВТ_Сотрудники
	               |ГДЕ
	               |	ВТ_Сотрудники.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПринятыеСотрудники.Сотрудник КАК Сотрудник
	               |			ИЗ
	               |				ВТ_ПринятыеСотрудники КАК ВТ_ПринятыеСотрудники)
	               |	И НЕ ВТ_Сотрудники.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТ_УволенныеСотрудники.Сотрудник КАК Сотрудник
	               |				ИЗ
	               |					ВТ_УволенныеСотрудники КАК ВТ_УволенныеСотрудники)";
	
	Запрос.УстановитьПараметр("Текст", Текст);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаНачала));
	Запрос.УстановитьПараметр("Прием", Перечисления.ВидыКадровыхСобытий.Прием);
	Запрос.УстановитьПараметр("Перемещение", Перечисления.ВидыКадровыхСобытий.Перемещение);
	Запрос.УстановитьПараметр("Увольнение", Перечисления.ВидыКадровыхСобытий.Увольнение);
	
	резЗапроса = Запрос.Выполнить();
	
	Если резЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат резЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти
#КонецЕсли
